Documents/УправлениеУслугами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеУслугами</Name>
			<BasedOn>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенныеУслугиПодробно</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.КачествоУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУправленияУслугами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКачества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоУслуге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УправлениеУслугами/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеУслугами, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Текст =
       "ВЫБРАТЬ
       |	УправлениеУслугамиЛицевыеСчета.ЛицевойСчет,
       |	УправлениеУслугамиУслуги.Услуга,
       |	УправлениеУслугамиУслуги.Ссылка.ДатаНачала КАК ДатаНачала,
       |	УправлениеУслугамиУслуги.Ссылка.ДатаОкончания КАК ДатаОкончания,
       |	УправлениеУслугамиЛицевыеСчета.Ссылка.Организация,
       |	УправлениеУслугамиУслуги.Ссылка.КоэффициентКачества
       |ПОМЕСТИТЬ ВременнаяТаблицаУслуги
       |ИЗ
       |	Документ.УправлениеУслугами.ЛицевыеСчета КАК УправлениеУслугамиЛицевыеСчета,
       |	Документ.УправлениеУслугами.Услуги КАК УправлениеУслугамиУслуги
       |ГДЕ
       |	УправлениеУслугамиЛицевыеСчета.Ссылка = &Ссылка
       |	И УправлениеУслугамиУслуги.Ссылка = &Ссылка
       |;
       |
       |////////////////////////////////////////////////////////////////////////////////
       |ВЫБРАТЬ
       |	УслугиДатаНачала.ЛицевойСчет,
       |	УслугиДатаНачала.Услуга,
       |	КОНЕЦПЕРИОДА(УслугиДатаНачала.ДатаНачала, ДЕНЬ) КАК Период,
       |	ИСТИНА КАК Действует,
       |	УслугиДатаНачала.Организация,
       |	УслугиДатаНачала.КоэффициентКачества КАК Коэффициент
       |ИЗ
       |	ВременнаяТаблицаУслуги КАК УслугиДатаНачала
       |ГДЕ
       |	УслугиДатаНачала.ДатаНачала <> &Пустаядата
       |
       |ОБЪЕДИНИТЬ ВСЕ
       |
       |ВЫБРАТЬ
       |	УслугиДатаОкончания.ЛицевойСчет,
       |	УслугиДатаОкончания.Услуга,
       |	НАЧАЛОПЕРИОДА(УслугиДатаОкончания.ДатаОкончания, ДЕНЬ),
       |	ЛОЖЬ,
       |	УслугиДатаОкончания.Организация,
       |	УслугиДатаОкончания.КоэффициентКачества
       |ИЗ
       |	ВременнаяТаблицаУслуги КАК УслугиДатаОкончания
       |ГДЕ
       |	УслугиДатаОкончания.ДатаОкончания <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеУслугами);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеУслуги", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
